app/controllers/base_controller.rb

  def all_users
    @users = User.all
---
SELECT * FROM `users`