app/controllers/sessions_controller.rb

  def create
    logout_keeping_session!
    user = User.authenticate(params[:login], params[:password])
    if user && !user.is_banned
      # Protects against session fixation attacks, causes request forgery
      # protection if user resubmits an earlier form using back
      # button. Uncomment if you understand the tradeoffs.
      # reset_session
      self.current_user = user
      new_cookie_flag = (params[:remember_me] == "1")
      handle_remember_cookie! new_cookie_flag
      current_ip = request.remote_ip
      last_ip = user.last_ip
      if ((current_ip.eql?(last_ip)) && user.logged_in) || !last_ip || !user.logged_in
        user.update_attributes(:logged_in => true, :last_ip => current_ip)
---
UPDATE `users` SET `updated_at` = '2010-10-30 02:02:00', `remember_token_expires_at` = NULL WHERE `id` = 1

  def destroy
    current_user.update_attribute(:logged_in, 'false')
---
UPDATE `users` SET `updated_at` = '2010-10-28 22:09:10', `logged_in` = 0 WHERE `id` = 2