app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def edit
    if current_user.is_admin?
      @user = User.find(params[:id])

INSERT INTO `users` (`salt`, `address`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `money`, `logged_in`, `profile_photo_file_name`, `updated_at`, `profile_photo_content_type`, `profile_photo_file_size`, `activation_code`, `is_admin`, `remember_token`, `last_name`, `phone`, `profile_photo_updated_at`, `login`, `reset_code`, `email`, `is_banned`, `first_name`) VALUES('79c46c3c4a04861bb7809cf0e26a1a3254c94cc7', '89273 SDGDK.ave', '2010-10-30 01:50:17', NULL, '833fa39b509db797ab061d77f1943256b882565c', NULL, 100.0, NULL, NULL, '2010-10-30 01:50:17', NULL, NULL, 'e3ae9509a15f1c12194a88d10af28de22ac3b262', 0, NULL, 'Me', '2930850', NULL, 'admin', NULL, 'bidme410@gmail.com', 0, 'Bid')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT * FROM `users` WHERE (`users`.`activation_code` = '001ef2d6e6cb516c98d20a2d94804041e0fc22f9') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-10-29 03:56:06', `profile_photo_file_size` = 10877, `profile_photo_content_type` = 'image/jpeg', `profile_photo_file_name` = '1.jpg', `profile_photo_updated_at` = '2010-10-29 03:56:06' WHERE `id` = 1
---
  def update
    if current_user.is_admin?
      @user = User.find(params[:id])
    else
      @user = current_user
    end
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def change_password
    if current_user.is_admin?
      @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`email` = 'nkim1204@gmail.com') LIMIT 1
---
  def forgot
      if request.post?
        user = User.find_by_email(params[:user][:email])

SELECT * FROM `users` WHERE (`users`.`reset_code` = 'f6a992374d40488f8d0ab8c148586b67cac12dca') LIMIT 1
UPDATE `users` SET `updated_at` = '2010-10-26 05:54:52', `crypted_password` = 'b0dbf3eeb1f313896460e235975bea3c8505bfc5' WHERE `id` = 1
---
    def reset
      @user = User.find_by_reset_code(params[:reset_code]) unless params[:reset_code].nil?
      if request.post?
        if @user.update_attributes(:password => params[:user][:password], :password_confirmation => params[:user][:password_confirmation])

SELECT * FROM `users` WHERE (`users`.`login` = 'nkim1204') LIMIT 1
INSERT INTO `messages` (`created_at`, `receiver_id`, `updated_at`, `sender_id`, `description`) VALUES('2010-10-26 05:39:59', 1, '2010-10-26 05:39:59', 2, 'FUCK YOU GABO')
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
    def send_message
      @user = current_user
      @receiver = User.find_by_login(params[:receiver])
      if @receiver
        @message = @user.sent_messages.build(:receiver_id => @receiver.id, :description => params[:description])
        @message.save
        @unread_messages = Message.find(:all, :conditions => {:receiver_id => @receiver.id, :unread => true})

SELECT * FROM `users` WHERE (`users`.`login` = '1') LIMIT 1
---
    def write_message
      @user = current_user
      @message = Message.new
      @message.sender = current_user
      @unread_messages = Message.find(:all, :conditions => {:receiver_id => current_user.id, :unread => true})
      if params[:receiver]
        @message.receiver = User.find_by_login(params[:receiver])

SELECT * FROM `messages` WHERE (`messages`.receiver_id = 1)
---
    def messagebox
      @user = current_user
      @messages = Message.paginate_by_receiver_id @user.id, :page => params[:page], :order => 'created_at DESC', :per_page => 10
      #@messages = @user.received_messages.sort_by{|m| m.created_at}.reverse
      @unread_messages = Message.find(:all, :conditions => {:receiver_id => current_user.id, :unread => true})

SELECT * FROM `messages` WHERE (`messages`.sender_id = 2)
---
    def sent_messages
      @user = current_user
      @sent_messages = @user.sent_messages.sort_by{|m| m.created_at}.reverse
      @unread_messages = Message.find(:all, :conditions => {:receiver_id => current_user.id, :unread => true})

SELECT * FROM `messages` WHERE (`messages`.`id` = 201)
---
    def show_message
      @message = Message.find(params[:id])

SELECT * FROM `messages` WHERE (`messages`.`id` = 257)
---
    def show_sent_message
      @message = Message.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`login` = 'nkim1204') LIMIT 1
---
    def profile
      @user = User.find_by_login(params[:username])

UPDATE `users` SET `updated_at` = '2010-10-29 04:13:47', `profile_photo_file_name` = NULL WHERE `id` = 5
---
    def remove_profile_photo
      @user = current_user
      @user.update_attribute(:profile_photo_file_name, nil)

SELECT * FROM `users` WHERE (`users`.`login` = 'ksh1204') LIMIT 1
INSERT INTO `messages` (`created_at`, `receiver_id`, `updated_at`, `sender_id`, `description`) VALUES('2010-10-29 08:34:52', 5, '2010-10-29 08:34:52', 1, 'nkim1204 has reported ksh1204! Do something about it!')
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
    def report_user
      @reporter = current_user
      @reportee = User.find_by_login(params[:username])
      if @reporter.id == @reportee.id
        gflash :error => "Unknown request!"
        redirect_back_or_default('/')
      end
      @admin = User.find_by_login('admin')
      @message = @reporter.sent_messages.build(:receiver_id => @admin.id, :description => "<a href='/profile/#{@reporter.login}'>#{@reporter.login}</a> has reported <a href='/profile/#{@reporter.login}'>#{@reportee.login}</a>! Do something about it!")
      @message.save
      @unread_messages = Message.find(:all, :conditions => {:receiver_id => @admin.id, :unread => true})

SELECT * FROM `users` WHERE (`users`.`login` = 'ksh1204') LIMIT 1
SELECT * FROM `follows` WHERE (`follows`.`follower_id` = 1 AND `follows`.`following_id` = 2) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `follows` (`created_at`, `updated_at`, `follower_id`, `following_id`) VALUES('2010-10-30 02:26:47', '2010-10-30 02:26:47', 1, 2)
INSERT INTO `messages` (`created_at`, `receiver_id`, `updated_at`, `sender_id`, `description`) VALUES('2010-10-30 02:27:37', 2, '2010-10-30 02:27:37', 1, 'admin is following you!')
---
    def follow_user
      @follower = current_user
      @following = User.find_by_login(params[:username])
      @user = @following
      if @follower.id == @following.id
        gflash :error => "Invalid request!"
        redirect_back_or_default('/')
      end
      exist = Follow.find(:first, :conditions => {:follower_id => @follower.id, :following_id => @following.id})
      if !exist
        @follow = @follower.follow_followings.build(:following_id => @following.id)
        @follow.save
        @message = @follower.sent_messages.build(:receiver_id => @following.id, :description => "You have a new follower! <a href='/profile/#{@follower.login}'>#{@follower.login}</a> is following you!")
        @message.save

SELECT * FROM `users` WHERE (`users`.`login` = 'nkim1204') LIMIT 1
SELECT * FROM `follows` WHERE (`follows`.`follower_id` = 1 AND `follows`.`following_id` = 2) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `follows` WHERE `id` = 17
---
    def unfollow_user
      @follower = current_user
      @following = User.find_by_login(params[:username])
      @user = @following
      if @follower.id == @following.id
        gflash :error => "Unknown request!"
        redirect_back_or_default('/')
      end
      exist = Follow.find(:first, :conditions => {:follower_id => @follower.id, :following_id => @following.id})
      if exist
        exist.destroy